h2zero/n-able-Arduino/boards.txt
ng_beacon.build.mcu=cortex-m0
ng_beacon.build.f_cpu=16000000
ng_beacon.build.board=NG_BEACON
ng_beacon.build.core=nRF5
ng_beacon.build.variant=ng_beacon
ng_beacon.build.variant_system_lib=
ng_beacon.build.float_flags=
ng_beacon.build.ldscript=nrf51_{build.chip}.ld
ng_beacon.build.lfclk_flags=-DUSE_LFXO
ng_beacon.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

ng_beacon.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
ng_beacon.menu.chip.xxaa.build.chip=xxaa
ng_beacon.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
ng_beacon.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
ng_beacon.menu.chip.xxac.build.chip=xxac
ng_beacon.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

ng_beacon.menu.custom_config.disable=Disabled
ng_beacon.menu.custom_config.enable=Enabled
ng_beacon.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
ng_beacon.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

ng_beacon.menu.main_stack.768=768
ng_beacon.menu.main_stack.768.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=768
ng_beacon.menu.main_stack.896=896
ng_beacon.menu.main_stack.896.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=896
ng_beacon.menu.main_stack.1024=1024
ng_beacon.menu.main_stack.1024.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1024
ng_beacon.menu.main_stack.1152=1152
ng_beacon.menu.main_stack.1152.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1152
ng_beacon.menu.main_stack.1280=1280
ng_beacon.menu.main_stack.1280.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1280
ng_beacon.menu.main_stack.1408=1408
ng_beacon.menu.main_stack.1408.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1408
ng_beacon.menu.main_stack.1536=1536
ng_beacon.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
ng_beacon.menu.main_stack.1664=1664
ng_beacon.menu.main_stack.1664.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1664
ng_beacon.menu.main_stack.1792=1792
ng_beacon.menu.main_stack.1792.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1792
ng_beacon.menu.main_stack.1920=1920
ng_beacon.menu.main_stack.1920.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1920
ng_beacon.menu.main_stack.2048=2048
ng_beacon.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
ng_beacon.menu.main_stack.custom=Custom (config file)
ng_beacon.menu.main_stack.custom.build.main_stack_flags=

ng_beacon.menu.hs_stack.1024=1024
ng_beacon.menu.hs_stack.1024.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1024
ng_beacon.menu.hs_stack.1152=1152
ng_beacon.menu.hs_stack.1152.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1152
ng_beacon.menu.hs_stack.1280=1280
ng_beacon.menu.hs_stack.1280.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1280
ng_beacon.menu.hs_stack.1408=1408
ng_beacon.menu.hs_stack.1408.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1408
ng_beacon.menu.hs_stack.1536=1536
ng_beacon.menu.hs_stack.1536.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1536
ng_beacon.menu.hs_stack.1664=1664
ng_beacon.menu.hs_stack.1664.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1664
ng_beacon.menu.hs_stack.1792=1792
ng_beacon.menu.hs_stack.1792.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1792
ng_beacon.menu.hs_stack.1920=1920
ng_beacon.menu.hs_stack.1920.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1920
ng_beacon.menu.hs_stack.2048=2048
ng_beacon.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
ng_beacon.menu.hs_stack.custom=Custom (config file)
ng_beacon.menu.hs_stack.custom.build.hs_stack_flags=

ng_beacon.menu.role.all=All
ng_beacon.menu.role.all.build.nimble_flags=
ng_beacon.menu.role.periph=Peripheral
ng_beacon.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
ng_beacon.menu.role.adv=Advertiser
ng_beacon.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
ng_beacon.menu.role.scan=Scanner
ng_beacon.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
ng_beacon.menu.role.central=Client
ng_beacon.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

ng_beacon.menu.cppDbgLvl.none=None
ng_beacon.menu.cppDbgLvl.none.build.cpp_debug=0
ng_beacon.menu.cppDbgLvl.error=Error
ng_beacon.menu.cppDbgLvl.error.build.cpp_debug=1
ng_beacon.menu.cppDbgLvl.warn=Warn
ng_beacon.menu.cppDbgLvl.warn.build.cpp_debug=2
ng_beacon.menu.cppDbgLvl.info=Info
ng_beacon.menu.cppDbgLvl.info.build.cpp_debug=3
ng_beacon.menu.cppDbgLvl.debug=Debug
ng_beacon.menu.cppDbgLvl.debug.build.cpp_debug=4


Beacon_PCA20006.name=Nordic Beacon Kit (PCA20006)

Beacon_PCA20006.upload.tool=openocd
Beacon_PCA20006.upload.target=nrf51
Beacon_PCA20006.upload.maximum_size=262144

Beacon_PCA20006.bootloader.tool=openocd

Beacon_PCA20006.build.mcu=cortex-m0
Beacon_PCA20006.build.f_cpu=16000000
Beacon_PCA20006.build.board=BEACON_PCA20006
Beacon_PCA20006.build.core=nRF5
Beacon_PCA20006.build.variant=Beacon_PCA20006
Beacon_PCA20006.build.variant_system_lib=
Beacon_PCA20006.build.float_flags=
Beacon_PCA20006.build.ldscript=nrf51_{build.chip}.ld
Beacon_PCA20006.build.lfclk_flags=-DUSE_LFXO
Beacon_PCA20006.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

Beacon_PCA20006.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
Beacon_PCA20006.menu.chip.xxaa.build.chip=xxaa
Beacon_PCA20006.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
Beacon_PCA20006.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
Beacon_PCA20006.menu.chip.xxac.build.chip=xxac
Beacon_PCA20006.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

Beacon_PCA20006.menu.custom_config.disable=Disabled
Beacon_PCA20006.menu.custom_config.enable=Enabled
Beacon_PCA20006.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
Beacon_PCA20006.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

