h2zero/n-able-Arduino/boards.txt
Beacon_PCA20006.menu.main_stack.768=768
Beacon_PCA20006.menu.main_stack.768.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=768
Beacon_PCA20006.menu.main_stack.896=896
Beacon_PCA20006.menu.main_stack.896.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=896
Beacon_PCA20006.menu.main_stack.1024=1024
Beacon_PCA20006.menu.main_stack.1024.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1024
Beacon_PCA20006.menu.main_stack.1152=1152
Beacon_PCA20006.menu.main_stack.1152.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1152
Beacon_PCA20006.menu.main_stack.1280=1280
Beacon_PCA20006.menu.main_stack.1280.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1280
Beacon_PCA20006.menu.main_stack.1408=1408
Beacon_PCA20006.menu.main_stack.1408.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1408
Beacon_PCA20006.menu.main_stack.1536=1536
Beacon_PCA20006.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
Beacon_PCA20006.menu.main_stack.1664=1664
Beacon_PCA20006.menu.main_stack.1664.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1664
Beacon_PCA20006.menu.main_stack.1792=1792
Beacon_PCA20006.menu.main_stack.1792.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1792
Beacon_PCA20006.menu.main_stack.1920=1920
Beacon_PCA20006.menu.main_stack.1920.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1920
Beacon_PCA20006.menu.main_stack.2048=2048
Beacon_PCA20006.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
Beacon_PCA20006.menu.main_stack.custom=Custom (config file)
Beacon_PCA20006.menu.main_stack.custom.build.main_stack_flags=

Beacon_PCA20006.menu.hs_stack.1024=1024
Beacon_PCA20006.menu.hs_stack.1024.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1024
Beacon_PCA20006.menu.hs_stack.1152=1152
Beacon_PCA20006.menu.hs_stack.1152.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1152
Beacon_PCA20006.menu.hs_stack.1280=1280
Beacon_PCA20006.menu.hs_stack.1280.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1280
Beacon_PCA20006.menu.hs_stack.1408=1408
Beacon_PCA20006.menu.hs_stack.1408.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1408
Beacon_PCA20006.menu.hs_stack.1536=1536
Beacon_PCA20006.menu.hs_stack.1536.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1536
Beacon_PCA20006.menu.hs_stack.1664=1664
Beacon_PCA20006.menu.hs_stack.1664.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1664
Beacon_PCA20006.menu.hs_stack.1792=1792
Beacon_PCA20006.menu.hs_stack.1792.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1792
Beacon_PCA20006.menu.hs_stack.1920=1920
Beacon_PCA20006.menu.hs_stack.1920.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1920
Beacon_PCA20006.menu.hs_stack.2048=2048
Beacon_PCA20006.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
Beacon_PCA20006.menu.hs_stack.custom=Custom (config file)
Beacon_PCA20006.menu.hs_stack.custom.build.hs_stack_flags=

Beacon_PCA20006.menu.role.all=All
Beacon_PCA20006.menu.role.all.build.nimble_flags=
Beacon_PCA20006.menu.role.periph=Peripheral
Beacon_PCA20006.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Beacon_PCA20006.menu.role.adv=Advertiser
Beacon_PCA20006.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Beacon_PCA20006.menu.role.scan=Scanner
Beacon_PCA20006.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Beacon_PCA20006.menu.role.central=Client
Beacon_PCA20006.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Beacon_PCA20006.menu.cppDbgLvl.none=None
Beacon_PCA20006.menu.cppDbgLvl.none.build.cpp_debug=0
Beacon_PCA20006.menu.cppDbgLvl.error=Error
Beacon_PCA20006.menu.cppDbgLvl.error.build.cpp_debug=1
Beacon_PCA20006.menu.cppDbgLvl.warn=Warn
Beacon_PCA20006.menu.cppDbgLvl.warn.build.cpp_debug=2
Beacon_PCA20006.menu.cppDbgLvl.info=Info
Beacon_PCA20006.menu.cppDbgLvl.info.build.cpp_debug=3
Beacon_PCA20006.menu.cppDbgLvl.debug=Debug
Beacon_PCA20006.menu.cppDbgLvl.debug.build.cpp_debug=4


BBCmicrobit.name=BBC micro:bit

BBCmicrobit.upload.tool=openocd
BBCmicrobit.upload.target=nrf51
BBCmicrobit.upload.maximum_size=262144

BBCmicrobit.bootloader.tool=openocd

BBCmicrobit.build.mcu=cortex-m0
BBCmicrobit.build.f_cpu=16000000
BBCmicrobit.build.board=BBC_MICROBIT
BBCmicrobit.build.core=nRF5
BBCmicrobit.build.variant=BBCmicrobit
BBCmicrobit.build.variant_system_lib=
BBCmicrobit.build.float_flags=
BBCmicrobit.build.ldscript=nrf51_{build.chip}.ld
BBCmicrobit.build.lfclk_flags=-DUSE_LFXO
BBCmicrobit.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

BBCmicrobit.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
BBCmicrobit.menu.chip.xxaa.build.chip=xxaa
BBCmicrobit.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
BBCmicrobit.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
BBCmicrobit.menu.chip.xxac.build.chip=xxac
BBCmicrobit.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

BBCmicrobit.menu.custom_config.disable=Disabled
BBCmicrobit.menu.custom_config.enable=Enabled
BBCmicrobit.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
BBCmicrobit.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

BBCmicrobit.menu.main_stack.768=768
BBCmicrobit.menu.main_stack.768.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=768
BBCmicrobit.menu.main_stack.896=896
BBCmicrobit.menu.main_stack.896.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=896
BBCmicrobit.menu.main_stack.1024=1024
BBCmicrobit.menu.main_stack.1024.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1024
BBCmicrobit.menu.main_stack.1152=1152
BBCmicrobit.menu.main_stack.1152.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1152
BBCmicrobit.menu.main_stack.1280=1280
BBCmicrobit.menu.main_stack.1280.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1280
BBCmicrobit.menu.main_stack.1408=1408
BBCmicrobit.menu.main_stack.1408.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1408
BBCmicrobit.menu.main_stack.1536=1536
BBCmicrobit.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
BBCmicrobit.menu.main_stack.1664=1664
BBCmicrobit.menu.main_stack.1664.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1664
BBCmicrobit.menu.main_stack.1792=1792
BBCmicrobit.menu.main_stack.1792.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1792
BBCmicrobit.menu.main_stack.1920=1920
BBCmicrobit.menu.main_stack.1920.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1920
BBCmicrobit.menu.main_stack.2048=2048
BBCmicrobit.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
BBCmicrobit.menu.main_stack.custom=Custom (config file)
BBCmicrobit.menu.main_stack.custom.build.main_stack_flags=

BBCmicrobit.menu.hs_stack.1024=1024
BBCmicrobit.menu.hs_stack.1024.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1024
BBCmicrobit.menu.hs_stack.1152=1152
BBCmicrobit.menu.hs_stack.1152.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1152
BBCmicrobit.menu.hs_stack.1280=1280
BBCmicrobit.menu.hs_stack.1280.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1280
BBCmicrobit.menu.hs_stack.1408=1408
BBCmicrobit.menu.hs_stack.1408.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1408
BBCmicrobit.menu.hs_stack.1536=1536
BBCmicrobit.menu.hs_stack.1536.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1536
BBCmicrobit.menu.hs_stack.1664=1664
BBCmicrobit.menu.hs_stack.1664.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1664
BBCmicrobit.menu.hs_stack.1792=1792
BBCmicrobit.menu.hs_stack.1792.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1792
BBCmicrobit.menu.hs_stack.1920=1920
BBCmicrobit.menu.hs_stack.1920.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1920
BBCmicrobit.menu.hs_stack.2048=2048
BBCmicrobit.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
BBCmicrobit.menu.hs_stack.custom=Custom (config file)
BBCmicrobit.menu.hs_stack.custom.build.hs_stack_flags=

BBCmicrobit.menu.role.all=All
BBCmicrobit.menu.role.all.build.nimble_flags=
BBCmicrobit.menu.role.periph=Peripheral
BBCmicrobit.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BBCmicrobit.menu.role.adv=Advertiser
BBCmicrobit.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BBCmicrobit.menu.role.scan=Scanner
BBCmicrobit.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BBCmicrobit.menu.role.central=Client
BBCmicrobit.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

