h2zero/n-able-Arduino/boards.txt
BBCmicrobit.menu.cppDbgLvl.none=None
BBCmicrobit.menu.cppDbgLvl.none.build.cpp_debug=0
BBCmicrobit.menu.cppDbgLvl.error=Error
BBCmicrobit.menu.cppDbgLvl.error.build.cpp_debug=1
BBCmicrobit.menu.cppDbgLvl.warn=Warn
BBCmicrobit.menu.cppDbgLvl.warn.build.cpp_debug=2
BBCmicrobit.menu.cppDbgLvl.info=Info
BBCmicrobit.menu.cppDbgLvl.info.build.cpp_debug=3
BBCmicrobit.menu.cppDbgLvl.debug=Debug
BBCmicrobit.menu.cppDbgLvl.debug.build.cpp_debug=4


nRF51DK.name=Nordic Semiconductor nRF51 DK

nRF51DK.upload.tool=openocd
nRF51DK.upload.target=nrf51
nRF51DK.upload.maximum_size=262144

nRF51DK.bootloader.tool=openocd

nRF51DK.build.mcu=cortex-m0
nRF51DK.build.f_cpu=16000000
nRF51DK.build.board=NRF51_DK
nRF51DK.build.core=nRF5
nRF51DK.build.variant=nRF51DK
nRF51DK.build.variant_system_lib=
nRF51DK.build.float_flags=
nRF51DK.build.ldscript=nrf51_{build.chip}.ld
nRF51DK.build.lfclk_flags=-DUSE_LFXO
nRF51DK.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

nRF51DK.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
nRF51DK.menu.chip.xxaa.build.chip=xxaa
nRF51DK.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
nRF51DK.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
nRF51DK.menu.chip.xxac.build.chip=xxac
nRF51DK.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

nRF51DK.menu.custom_config.disable=Disabled
nRF51DK.menu.custom_config.enable=Enabled
nRF51DK.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
nRF51DK.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

nRF51DK.menu.main_stack.768=768
nRF51DK.menu.main_stack.768.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=768
nRF51DK.menu.main_stack.896=896
nRF51DK.menu.main_stack.896.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=896
nRF51DK.menu.main_stack.1024=1024
nRF51DK.menu.main_stack.1024.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1024
nRF51DK.menu.main_stack.1152=1152
nRF51DK.menu.main_stack.1152.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1152
nRF51DK.menu.main_stack.1280=1280
nRF51DK.menu.main_stack.1280.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1280
nRF51DK.menu.main_stack.1408=1408
nRF51DK.menu.main_stack.1408.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1408
nRF51DK.menu.main_stack.1536=1536
nRF51DK.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
nRF51DK.menu.main_stack.1664=1664
nRF51DK.menu.main_stack.1664.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1664
nRF51DK.menu.main_stack.1792=1792
nRF51DK.menu.main_stack.1792.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1792
nRF51DK.menu.main_stack.1920=1920
nRF51DK.menu.main_stack.1920.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1920
nRF51DK.menu.main_stack.2048=2048
nRF51DK.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
nRF51DK.menu.main_stack.custom=Custom (config file)
nRF51DK.menu.main_stack.custom.build.main_stack_flags=

nRF51DK.menu.hs_stack.1024=1024
nRF51DK.menu.hs_stack.1024.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1024
nRF51DK.menu.hs_stack.1152=1152
nRF51DK.menu.hs_stack.1152.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1152
nRF51DK.menu.hs_stack.1280=1280
nRF51DK.menu.hs_stack.1280.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1280
nRF51DK.menu.hs_stack.1408=1408
nRF51DK.menu.hs_stack.1408.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1408
nRF51DK.menu.hs_stack.1536=1536
nRF51DK.menu.hs_stack.1536.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1536
nRF51DK.menu.hs_stack.1664=1664
nRF51DK.menu.hs_stack.1664.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1664
nRF51DK.menu.hs_stack.1792=1792
nRF51DK.menu.hs_stack.1792.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1792
nRF51DK.menu.hs_stack.1920=1920
nRF51DK.menu.hs_stack.1920.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1920
nRF51DK.menu.hs_stack.2048=2048
nRF51DK.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
nRF51DK.menu.hs_stack.custom=Custom (config file)
nRF51DK.menu.hs_stack.custom.build.hs_stack_flags=

nRF51DK.menu.role.all=All
nRF51DK.menu.role.all.build.nimble_flags=
nRF51DK.menu.role.periph=Peripheral
nRF51DK.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
nRF51DK.menu.role.adv=Advertiser
nRF51DK.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
nRF51DK.menu.role.scan=Scanner
nRF51DK.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
nRF51DK.menu.role.central=Client
nRF51DK.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

nRF51DK.menu.cppDbgLvl.none=None
nRF51DK.menu.cppDbgLvl.none.build.cpp_debug=0
nRF51DK.menu.cppDbgLvl.error=Error
nRF51DK.menu.cppDbgLvl.error.build.cpp_debug=1
nRF51DK.menu.cppDbgLvl.warn=Warn
nRF51DK.menu.cppDbgLvl.warn.build.cpp_debug=2
nRF51DK.menu.cppDbgLvl.info=Info
nRF51DK.menu.cppDbgLvl.info.build.cpp_debug=3
nRF51DK.menu.cppDbgLvl.debug=Debug
nRF51DK.menu.cppDbgLvl.debug.build.cpp_debug=4


nRF51Dongle.name=Nordic nRF51 Dongle

nRF51Dongle.upload.tool=openocd
nRF51Dongle.upload.target=nrf51
nRF51Dongle.upload.maximum_size=262144

nRF51Dongle.bootloader.tool=openocd

nRF51Dongle.build.mcu=cortex-m0
nRF51Dongle.build.f_cpu=16000000
nRF51Dongle.build.board=NRF51_DONGLE
nRF51Dongle.build.core=nRF5
nRF51Dongle.build.variant=nRF51_Dongle
nRF51Dongle.build.variant_system_lib=
nRF51Dongle.build.float_flags=
nRF51Dongle.build.ldscript=nrf51_{build.chip}.ld
nRF51Dongle.build.lfclk_flags=-DUSE_LFXO
nRF51Dongle.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

nRF51Dongle.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
nRF51Dongle.menu.chip.xxaa.build.chip=xxaa
nRF51Dongle.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
nRF51Dongle.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
nRF51Dongle.menu.chip.xxac.build.chip=xxac
nRF51Dongle.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

