h2zero/n-able-Arduino/boards.txt
OSHChip.menu.role.all=All
OSHChip.menu.role.all.build.nimble_flags=
OSHChip.menu.role.periph=Peripheral
OSHChip.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
OSHChip.menu.role.adv=Advertiser
OSHChip.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
OSHChip.menu.role.scan=Scanner
OSHChip.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
OSHChip.menu.role.central=Client
OSHChip.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

OSHChip.menu.cppDbgLvl.none=None
OSHChip.menu.cppDbgLvl.none.build.cpp_debug=0
OSHChip.menu.cppDbgLvl.error=Error
OSHChip.menu.cppDbgLvl.error.build.cpp_debug=1
OSHChip.menu.cppDbgLvl.warn=Warn
OSHChip.menu.cppDbgLvl.warn.build.cpp_debug=2
OSHChip.menu.cppDbgLvl.info=Info
OSHChip.menu.cppDbgLvl.info.build.cpp_debug=3
OSHChip.menu.cppDbgLvl.debug=Debug
OSHChip.menu.cppDbgLvl.debug.build.cpp_debug=4


RedBearLab_nRF51822.name=RedBearLab nRF51822

RedBearLab_nRF51822.upload.tool=openocd
RedBearLab_nRF51822.upload.target=nrf51
RedBearLab_nRF51822.upload.maximum_size=262144

RedBearLab_nRF51822.bootloader.tool=openocd

RedBearLab_nRF51822.build.mcu=cortex-m0
RedBearLab_nRF51822.build.f_cpu=16000000
RedBearLab_nRF51822.build.board=REDBEARLAB_NRF51822
RedBearLab_nRF51822.build.core=nRF5
RedBearLab_nRF51822.build.variant=RedBearLab_nRF51822
RedBearLab_nRF51822.build.variant_system_lib=
RedBearLab_nRF51822.build.float_flags=
RedBearLab_nRF51822.build.ldscript=nrf51_{build.chip}.ld
RedBearLab_nRF51822.build.lfclk_flags=-DUSE_LFXO
RedBearLab_nRF51822.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

RedBearLab_nRF51822.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
RedBearLab_nRF51822.menu.chip.xxaa.build.chip=xxaa
RedBearLab_nRF51822.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
RedBearLab_nRF51822.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
RedBearLab_nRF51822.menu.chip.xxac.build.chip=xxac
RedBearLab_nRF51822.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

RedBearLab_nRF51822.menu.custom_config.disable=Disabled
RedBearLab_nRF51822.menu.custom_config.enable=Enabled
RedBearLab_nRF51822.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
RedBearLab_nRF51822.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

RedBearLab_nRF51822.menu.main_stack.768=768
RedBearLab_nRF51822.menu.main_stack.768.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=768
RedBearLab_nRF51822.menu.main_stack.896=896
RedBearLab_nRF51822.menu.main_stack.896.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=896
RedBearLab_nRF51822.menu.main_stack.1024=1024
RedBearLab_nRF51822.menu.main_stack.1024.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1024
RedBearLab_nRF51822.menu.main_stack.1152=1152
RedBearLab_nRF51822.menu.main_stack.1152.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1152
RedBearLab_nRF51822.menu.main_stack.1280=1280
RedBearLab_nRF51822.menu.main_stack.1280.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1280
RedBearLab_nRF51822.menu.main_stack.1408=1408
RedBearLab_nRF51822.menu.main_stack.1408.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1408
RedBearLab_nRF51822.menu.main_stack.1536=1536
RedBearLab_nRF51822.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
RedBearLab_nRF51822.menu.main_stack.1664=1664
RedBearLab_nRF51822.menu.main_stack.1664.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1664
RedBearLab_nRF51822.menu.main_stack.1792=1792
RedBearLab_nRF51822.menu.main_stack.1792.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1792
RedBearLab_nRF51822.menu.main_stack.1920=1920
RedBearLab_nRF51822.menu.main_stack.1920.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1920
RedBearLab_nRF51822.menu.main_stack.2048=2048
RedBearLab_nRF51822.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
RedBearLab_nRF51822.menu.main_stack.custom=Custom (config file)
RedBearLab_nRF51822.menu.main_stack.custom.build.main_stack_flags=

RedBearLab_nRF51822.menu.hs_stack.1024=1024
RedBearLab_nRF51822.menu.hs_stack.1024.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1024
RedBearLab_nRF51822.menu.hs_stack.1152=1152
RedBearLab_nRF51822.menu.hs_stack.1152.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1152
RedBearLab_nRF51822.menu.hs_stack.1280=1280
RedBearLab_nRF51822.menu.hs_stack.1280.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1280
RedBearLab_nRF51822.menu.hs_stack.1408=1408
RedBearLab_nRF51822.menu.hs_stack.1408.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1408
RedBearLab_nRF51822.menu.hs_stack.1536=1536
RedBearLab_nRF51822.menu.hs_stack.1536.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1536
RedBearLab_nRF51822.menu.hs_stack.1664=1664
RedBearLab_nRF51822.menu.hs_stack.1664.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1664
RedBearLab_nRF51822.menu.hs_stack.1792=1792
RedBearLab_nRF51822.menu.hs_stack.1792.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1792
RedBearLab_nRF51822.menu.hs_stack.1920=1920
RedBearLab_nRF51822.menu.hs_stack.1920.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1920
RedBearLab_nRF51822.menu.hs_stack.2048=2048
RedBearLab_nRF51822.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
RedBearLab_nRF51822.menu.hs_stack.custom=Custom (config file)
RedBearLab_nRF51822.menu.hs_stack.custom.build.hs_stack_flags=

RedBearLab_nRF51822.menu.role.all=All
RedBearLab_nRF51822.menu.role.all.build.nimble_flags=
RedBearLab_nRF51822.menu.role.periph=Peripheral
RedBearLab_nRF51822.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
RedBearLab_nRF51822.menu.role.adv=Advertiser
RedBearLab_nRF51822.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
RedBearLab_nRF51822.menu.role.scan=Scanner
RedBearLab_nRF51822.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
RedBearLab_nRF51822.menu.role.central=Client
RedBearLab_nRF51822.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

