h2zero/n-able-Arduino/boards.txt
RedBearLab_nRF51822.menu.cppDbgLvl.none=None
RedBearLab_nRF51822.menu.cppDbgLvl.none.build.cpp_debug=0
RedBearLab_nRF51822.menu.cppDbgLvl.error=Error
RedBearLab_nRF51822.menu.cppDbgLvl.error.build.cpp_debug=1
RedBearLab_nRF51822.menu.cppDbgLvl.warn=Warn
RedBearLab_nRF51822.menu.cppDbgLvl.warn.build.cpp_debug=2
RedBearLab_nRF51822.menu.cppDbgLvl.info=Info
RedBearLab_nRF51822.menu.cppDbgLvl.info.build.cpp_debug=3
RedBearLab_nRF51822.menu.cppDbgLvl.debug=Debug
RedBearLab_nRF51822.menu.cppDbgLvl.debug.build.cpp_debug=4


BLENano.name=RedBearLab BLE Nano

BLENano.upload.tool=openocd
BLENano.upload.target=nrf51
BLENano.upload.maximum_size=262144

BLENano.bootloader.tool=openocd

BLENano.build.mcu=cortex-m0
BLENano.build.f_cpu=16000000
BLENano.build.board=BLE_NANO
BLENano.build.core=nRF5
BLENano.build.variant=BLENano
BLENano.build.variant_system_lib=
BLENano.build.float_flags=
BLENano.build.ldscript=nrf51_{build.chip}.ld
BLENano.build.lfclk_flags=-DUSE_LFXO
BLENano.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

BLENano.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
BLENano.menu.chip.xxaa.build.chip=xxaa
BLENano.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
BLENano.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
BLENano.menu.chip.xxac.build.chip=xxac
BLENano.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

BLENano.menu.custom_config.disable=Disabled
BLENano.menu.custom_config.enable=Enabled
BLENano.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
BLENano.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

BLENano.menu.main_stack.768=768
BLENano.menu.main_stack.768.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=768
BLENano.menu.main_stack.896=896
BLENano.menu.main_stack.896.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=896
BLENano.menu.main_stack.1024=1024
BLENano.menu.main_stack.1024.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1024
BLENano.menu.main_stack.1152=1152
BLENano.menu.main_stack.1152.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1152
BLENano.menu.main_stack.1280=1280
BLENano.menu.main_stack.1280.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1280
BLENano.menu.main_stack.1408=1408
BLENano.menu.main_stack.1408.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1408
BLENano.menu.main_stack.1536=1536
BLENano.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
BLENano.menu.main_stack.1664=1664
BLENano.menu.main_stack.1664.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1664
BLENano.menu.main_stack.1792=1792
BLENano.menu.main_stack.1792.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1792
BLENano.menu.main_stack.1920=1920
BLENano.menu.main_stack.1920.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1920
BLENano.menu.main_stack.2048=2048
BLENano.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
BLENano.menu.main_stack.custom=Custom (config file)
BLENano.menu.main_stack.custom.build.main_stack_flags=

BLENano.menu.hs_stack.1024=1024
BLENano.menu.hs_stack.1024.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1024
BLENano.menu.hs_stack.1152=1152
BLENano.menu.hs_stack.1152.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1152
BLENano.menu.hs_stack.1280=1280
BLENano.menu.hs_stack.1280.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1280
BLENano.menu.hs_stack.1408=1408
BLENano.menu.hs_stack.1408.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1408
BLENano.menu.hs_stack.1536=1536
BLENano.menu.hs_stack.1536.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1536
BLENano.menu.hs_stack.1664=1664
BLENano.menu.hs_stack.1664.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1664
BLENano.menu.hs_stack.1792=1792
BLENano.menu.hs_stack.1792.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1792
BLENano.menu.hs_stack.1920=1920
BLENano.menu.hs_stack.1920.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1920
BLENano.menu.hs_stack.2048=2048
BLENano.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
BLENano.menu.hs_stack.custom=Custom (config file)
BLENano.menu.hs_stack.custom.build.hs_stack_flags=

BLENano.menu.role.all=All
BLENano.menu.role.all.build.nimble_flags=
BLENano.menu.role.periph=Peripheral
BLENano.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BLENano.menu.role.adv=Advertiser
BLENano.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BLENano.menu.role.scan=Scanner
BLENano.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BLENano.menu.role.central=Client
BLENano.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BLENano.menu.cppDbgLvl.none=None
BLENano.menu.cppDbgLvl.none.build.cpp_debug=0
BLENano.menu.cppDbgLvl.error=Error
BLENano.menu.cppDbgLvl.error.build.cpp_debug=1
BLENano.menu.cppDbgLvl.warn=Warn
BLENano.menu.cppDbgLvl.warn.build.cpp_debug=2
BLENano.menu.cppDbgLvl.info=Info
BLENano.menu.cppDbgLvl.info.build.cpp_debug=3
BLENano.menu.cppDbgLvl.debug=Debug
BLENano.menu.cppDbgLvl.debug.build.cpp_debug=4


TinyBLE.name=TinyBLE

TinyBLE.upload.tool=openocd
TinyBLE.upload.target=nrf51
TinyBLE.upload.maximum_size=262144

TinyBLE.bootloader.tool=openocd

TinyBLE.build.mcu=cortex-m0
TinyBLE.build.f_cpu=16000000
TinyBLE.build.board=TINYBLE
TinyBLE.build.core=nRF5
TinyBLE.build.variant=TinyBLE
TinyBLE.build.variant_system_lib=
TinyBLE.build.float_flags=
TinyBLE.build.ldscript=nrf51_{build.chip}.ld
TinyBLE.build.lfclk_flags=-DUSE_LFXO
TinyBLE.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

TinyBLE.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
TinyBLE.menu.chip.xxaa.build.chip=xxaa
TinyBLE.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
TinyBLE.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
TinyBLE.menu.chip.xxac.build.chip=xxac
TinyBLE.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

TinyBLE.menu.custom_config.disable=Disabled
TinyBLE.menu.custom_config.enable=Enabled
TinyBLE.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
TinyBLE.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

TinyBLE.menu.main_stack.768=768
TinyBLE.menu.main_stack.768.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=768
TinyBLE.menu.main_stack.896=896
TinyBLE.menu.main_stack.896.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=896
TinyBLE.menu.main_stack.1024=1024
TinyBLE.menu.main_stack.1024.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1024
TinyBLE.menu.main_stack.1152=1152
TinyBLE.menu.main_stack.1152.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1152
TinyBLE.menu.main_stack.1280=1280
TinyBLE.menu.main_stack.1280.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1280
TinyBLE.menu.main_stack.1408=1408
TinyBLE.menu.main_stack.1408.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1408
TinyBLE.menu.main_stack.1536=1536
TinyBLE.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
TinyBLE.menu.main_stack.1664=1664
TinyBLE.menu.main_stack.1664.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1664
TinyBLE.menu.main_stack.1792=1792
TinyBLE.menu.main_stack.1792.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1792
TinyBLE.menu.main_stack.1920=1920
TinyBLE.menu.main_stack.1920.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1920
TinyBLE.menu.main_stack.2048=2048
TinyBLE.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
TinyBLE.menu.main_stack.custom=Custom (config file)
TinyBLE.menu.main_stack.custom.build.main_stack_flags=

TinyBLE.menu.hs_stack.1024=1024
TinyBLE.menu.hs_stack.1024.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1024
TinyBLE.menu.hs_stack.1152=1152
TinyBLE.menu.hs_stack.1152.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1152
TinyBLE.menu.hs_stack.1280=1280
TinyBLE.menu.hs_stack.1280.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1280
TinyBLE.menu.hs_stack.1408=1408
TinyBLE.menu.hs_stack.1408.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1408
TinyBLE.menu.hs_stack.1536=1536
TinyBLE.menu.hs_stack.1536.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1536
TinyBLE.menu.hs_stack.1664=1664
TinyBLE.menu.hs_stack.1664.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1664
TinyBLE.menu.hs_stack.1792=1792
TinyBLE.menu.hs_stack.1792.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1792
TinyBLE.menu.hs_stack.1920=1920
TinyBLE.menu.hs_stack.1920.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1920
TinyBLE.menu.hs_stack.2048=2048
TinyBLE.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
TinyBLE.menu.hs_stack.custom=Custom (config file)
TinyBLE.menu.hs_stack.custom.build.hs_stack_flags=

TinyBLE.menu.role.all=All
TinyBLE.menu.role.all.build.nimble_flags=
TinyBLE.menu.role.periph=Peripheral
TinyBLE.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
TinyBLE.menu.role.adv=Advertiser
TinyBLE.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
TinyBLE.menu.role.scan=Scanner
TinyBLE.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
TinyBLE.menu.role.central=Client
TinyBLE.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

