h2zero/n-able-Arduino/boards.txt
Generic_nRF52832.menu.custom_config.disable=Disabled
Generic_nRF52832.menu.custom_config.enable=Enabled
Generic_nRF52832.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
Generic_nRF52832.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

Generic_nRF52832.menu.main_stack.1536=1536
Generic_nRF52832.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
Generic_nRF52832.menu.main_stack.2048=2048
Generic_nRF52832.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
Generic_nRF52832.menu.main_stack.2560=2560
Generic_nRF52832.menu.main_stack.2560.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2560
Generic_nRF52832.menu.main_stack.3072=3072
Generic_nRF52832.menu.main_stack.3072.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3072
Generic_nRF52832.menu.main_stack.3584=3584
Generic_nRF52832.menu.main_stack.3584.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3584
Generic_nRF52832.menu.main_stack.4096=4096
Generic_nRF52832.menu.main_stack.4096.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=4096
Generic_nRF52832.menu.main_stack.custom=Custom (config file)
Generic_nRF52832.menu.main_stack.custom.build.main_stack_flags=

Generic_nRF52832.menu.hs_stack.2048=2048
Generic_nRF52832.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
Generic_nRF52832.menu.hs_stack.2560=2560
Generic_nRF52832.menu.hs_stack.2560.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2560
Generic_nRF52832.menu.hs_stack.3072=3072
Generic_nRF52832.menu.hs_stack.3072.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3072
Generic_nRF52832.menu.hs_stack.3584=3584
Generic_nRF52832.menu.hs_stack.3584.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3584
Generic_nRF52832.menu.hs_stack.4096=4096
Generic_nRF52832.menu.hs_stack.4096.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
Generic_nRF52832.menu.hs_stack.custom=Custom (config file)
Generic_nRF52832.menu.hs_stack.custom.build.hs_stack_flags=

Generic_nRF52832.menu.role.all=All
Generic_nRF52832.menu.role.all.build.nimble_flags=
Generic_nRF52832.menu.role.periph=Peripheral
Generic_nRF52832.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Generic_nRF52832.menu.role.adv=Advertiser
Generic_nRF52832.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Generic_nRF52832.menu.role.scan=Scanner
Generic_nRF52832.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Generic_nRF52832.menu.role.central=Client
Generic_nRF52832.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Generic_nRF52832.menu.cppDbgLvl.none=None
Generic_nRF52832.menu.cppDbgLvl.none.build.cpp_debug=0
Generic_nRF52832.menu.cppDbgLvl.error=Error
Generic_nRF52832.menu.cppDbgLvl.error.build.cpp_debug=1
Generic_nRF52832.menu.cppDbgLvl.warn=Warn
Generic_nRF52832.menu.cppDbgLvl.warn.build.cpp_debug=2
Generic_nRF52832.menu.cppDbgLvl.info=Info
Generic_nRF52832.menu.cppDbgLvl.info.build.cpp_debug=3
Generic_nRF52832.menu.cppDbgLvl.debug=Debug
Generic_nRF52832.menu.cppDbgLvl.debug.build.cpp_debug=4



nRF52DK.name=Nordic nRF52832DK (PCA10040)

nRF52DK.vid.0=0x1366
nRF52DK.pid.0=0x1015

nRF52DK.upload.tool=openocd
nRF52DK.upload.protocol=jlink
nRF52DK.upload.target=nrf52
nRF52DK.upload.maximum_size=524288
nRF52DK.upload.setup_command=transport select swd;
nRF52DK.upload.use_1200bps_touch=false
nRF52DK.upload.wait_for_upload_port=false
nRF52DK.upload.native_usb=false

nRF52DK.bootloader.tool=openocd

nRF52DK.build.mcu=cortex-m4
nRF52DK.build.f_cpu=64000000
nRF52DK.build.board=NRF52_DK
nRF52DK.build.core=nRF5
nRF52DK.build.variant=nRF52832_DK
nRF52DK.build.variant_system_lib=
nRF52DK.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
nRF52DK.build.ldscript=nrf52_xxaa.ld
nRF52DK.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

nRF52DK.build.lfclk_flags=-DUSE_LFXO

nRF52DK.menu.custom_config.disable=Disabled
nRF52DK.menu.custom_config.enable=Enabled
nRF52DK.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
nRF52DK.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

nRF52DK.menu.main_stack.1536=1536
nRF52DK.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
nRF52DK.menu.main_stack.2048=2048
nRF52DK.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
nRF52DK.menu.main_stack.2560=2560
nRF52DK.menu.main_stack.2560.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2560
nRF52DK.menu.main_stack.3072=3072
nRF52DK.menu.main_stack.3072.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3072
nRF52DK.menu.main_stack.3584=3584
nRF52DK.menu.main_stack.3584.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3584
nRF52DK.menu.main_stack.4096=4096
nRF52DK.menu.main_stack.4096.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=4096
nRF52DK.menu.main_stack.custom=Custom (config file)
nRF52DK.menu.main_stack.custom.build.main_stack_flags=

nRF52DK.menu.hs_stack.2048=2048
nRF52DK.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
nRF52DK.menu.hs_stack.2560=2560
nRF52DK.menu.hs_stack.2560.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2560
nRF52DK.menu.hs_stack.3072=3072
nRF52DK.menu.hs_stack.3072.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3072
nRF52DK.menu.hs_stack.3584=3584
nRF52DK.menu.hs_stack.3584.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3584
nRF52DK.menu.hs_stack.4096=4096
nRF52DK.menu.hs_stack.4096.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
nRF52DK.menu.hs_stack.custom=Custom (config file)
nRF52DK.menu.hs_stack.custom.build.hs_stack_flags=

nRF52DK.menu.role.all=All
nRF52DK.menu.role.all.build.nimble_flags=
nRF52DK.menu.role.periph=Peripheral
nRF52DK.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
nRF52DK.menu.role.adv=Advertiser
nRF52DK.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
nRF52DK.menu.role.scan=Scanner
nRF52DK.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
nRF52DK.menu.role.central=Client
nRF52DK.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

nRF52DK.menu.cppDbgLvl.none=None
nRF52DK.menu.cppDbgLvl.none.build.cpp_debug=0
nRF52DK.menu.cppDbgLvl.error=Error
nRF52DK.menu.cppDbgLvl.error.build.cpp_debug=1
nRF52DK.menu.cppDbgLvl.warn=Warn
nRF52DK.menu.cppDbgLvl.warn.build.cpp_debug=2
nRF52DK.menu.cppDbgLvl.info=Info
nRF52DK.menu.cppDbgLvl.info.build.cpp_debug=3
nRF52DK.menu.cppDbgLvl.debug=Debug
nRF52DK.menu.cppDbgLvl.debug.build.cpp_debug=4



