h2zero/n-able-Arduino/boards.txt
BT5032A-TB.name=Ebyte BT5032A-TB

BT5032A-TB.upload.tool=openocd
BT5032A-TB.upload.target=nrf52
BT5032A-TB.upload.maximum_size=524288

BT5032A-TB.bootloader.tool=openocd

BT5032A-TB.build.mcu=cortex-m4
BT5032A-TB.build.f_cpu=64000000
BT5032A-TB.build.board=BT5032A_TB
BT5032A-TB.build.core=nRF5
BT5032A-TB.build.variant=BT5032A_TB
BT5032A-TB.build.variant_system_lib=
BT5032A-TB.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
BT5032A-TB.build.ldscript=nrf52_xxaa.ld
BT5032A-TB.build.lfclk_flags=-DUSE_LFXO
BT5032A-TB.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

BT5032A-TB.menu.custom_config.disable=Disabled
BT5032A-TB.menu.custom_config.enable=Enabled
BT5032A-TB.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
BT5032A-TB.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

BT5032A-TB.menu.main_stack.1536=1536
BT5032A-TB.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
BT5032A-TB.menu.main_stack.2048=2048
BT5032A-TB.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
BT5032A-TB.menu.main_stack.2560=2560
BT5032A-TB.menu.main_stack.2560.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2560
BT5032A-TB.menu.main_stack.3072=3072
BT5032A-TB.menu.main_stack.3072.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3072
BT5032A-TB.menu.main_stack.3584=3584
BT5032A-TB.menu.main_stack.3584.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3584
BT5032A-TB.menu.main_stack.4096=4096
BT5032A-TB.menu.main_stack.4096.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=4096
BT5032A-TB.menu.main_stack.custom=Custom (config file)
BT5032A-TB.menu.main_stack.custom.build.main_stack_flags=

BT5032A-TB.menu.hs_stack.2048=2048
BT5032A-TB.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
BT5032A-TB.menu.hs_stack.2560=2560
BT5032A-TB.menu.hs_stack.2560.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2560
BT5032A-TB.menu.hs_stack.3072=3072
BT5032A-TB.menu.hs_stack.3072.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3072
BT5032A-TB.menu.hs_stack.3584=3584
BT5032A-TB.menu.hs_stack.3584.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3584
BT5032A-TB.menu.hs_stack.4096=4096
BT5032A-TB.menu.hs_stack.4096.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
BT5032A-TB.menu.hs_stack.custom=Custom (config file)
BT5032A-TB.menu.hs_stack.custom.build.hs_stack_flags=

BT5032A-TB.menu.role.all=All
BT5032A-TB.menu.role.all.build.nimble_flags=
BT5032A-TB.menu.role.periph=Peripheral
BT5032A-TB.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BT5032A-TB.menu.role.adv=Advertiser
BT5032A-TB.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BT5032A-TB.menu.role.scan=Scanner
BT5032A-TB.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BT5032A-TB.menu.role.central=Client
BT5032A-TB.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BT5032A-TB.menu.cppDbgLvl.none=None
BT5032A-TB.menu.cppDbgLvl.none.build.cpp_debug=0
BT5032A-TB.menu.cppDbgLvl.error=Error
BT5032A-TB.menu.cppDbgLvl.error.build.cpp_debug=1
BT5032A-TB.menu.cppDbgLvl.warn=Warn
BT5032A-TB.menu.cppDbgLvl.warn.build.cpp_debug=2
BT5032A-TB.menu.cppDbgLvl.info=Info
BT5032A-TB.menu.cppDbgLvl.info.build.cpp_debug=3
BT5032A-TB.menu.cppDbgLvl.debug=Debug
BT5032A-TB.menu.cppDbgLvl.debug.build.cpp_debug=4



bluey.name=Electronut labs bluey

bluey.upload.tool=openocd
bluey.upload.target=nrf52
bluey.upload.maximum_size=524288

bluey.bootloader.tool=openocd

bluey.build.mcu=cortex-m4
bluey.build.f_cpu=64000000
bluey.build.board=ELECTRONUT_BLUEY
bluey.build.core=nRF5
bluey.build.variant=bluey
bluey.build.variant_system_lib=
bluey.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
bluey.build.ldscript=nrf52_xxaa.ld
bluey.build.lfclk_flags=-DUSE_LFXO
bluey.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

bluey.menu.custom_config.disable=Disabled
bluey.menu.custom_config.enable=Enabled
bluey.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
bluey.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

bluey.menu.main_stack.1536=1536
bluey.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
bluey.menu.main_stack.2048=2048
bluey.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
bluey.menu.main_stack.2560=2560
bluey.menu.main_stack.2560.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2560
bluey.menu.main_stack.3072=3072
bluey.menu.main_stack.3072.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3072
bluey.menu.main_stack.3584=3584
bluey.menu.main_stack.3584.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3584
bluey.menu.main_stack.4096=4096
bluey.menu.main_stack.4096.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=4096
bluey.menu.main_stack.custom=Custom (config file)
bluey.menu.main_stack.custom.build.main_stack_flags=

bluey.menu.hs_stack.2048=2048
bluey.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
bluey.menu.hs_stack.2560=2560
bluey.menu.hs_stack.2560.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2560
bluey.menu.hs_stack.3072=3072
bluey.menu.hs_stack.3072.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3072
bluey.menu.hs_stack.3584=3584
bluey.menu.hs_stack.3584.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3584
bluey.menu.hs_stack.4096=4096
bluey.menu.hs_stack.4096.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
bluey.menu.hs_stack.custom=Custom (config file)
bluey.menu.hs_stack.custom.build.hs_stack_flags=

