h2zero/n-able-Arduino/boards.txt
bluey.menu.role.all=All
bluey.menu.role.all.build.nimble_flags=
bluey.menu.role.periph=Peripheral
bluey.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
bluey.menu.role.adv=Advertiser
bluey.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
bluey.menu.role.scan=Scanner
bluey.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
bluey.menu.role.central=Client
bluey.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

bluey.menu.cppDbgLvl.none=None
bluey.menu.cppDbgLvl.none.build.cpp_debug=0
bluey.menu.cppDbgLvl.error=Error
bluey.menu.cppDbgLvl.error.build.cpp_debug=1
bluey.menu.cppDbgLvl.warn=Warn
bluey.menu.cppDbgLvl.warn.build.cpp_debug=2
bluey.menu.cppDbgLvl.info=Info
bluey.menu.cppDbgLvl.info.build.cpp_debug=3
bluey.menu.cppDbgLvl.debug=Debug
bluey.menu.cppDbgLvl.debug.build.cpp_debug=4



hackaBLE.name=Electronut labs hackaBLE

hackaBLE.upload.tool=openocd
hackaBLE.upload.target=nrf52
hackaBLE.upload.maximum_size=524288

hackaBLE.bootloader.tool=openocd

hackaBLE.build.mcu=cortex-m4
hackaBLE.build.f_cpu=64000000
hackaBLE.build.board=ELECTRONUT_HACKABLE
hackaBLE.build.core=nRF5
hackaBLE.build.variant=hackaBLE
hackaBLE.build.variant_system_lib=
hackaBLE.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
hackaBLE.build.ldscript=nrf52_xxaa.ld
hackaBLE.build.lfclk_flags=-DUSE_LFXO
hackaBLE.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

hackaBLE.menu.custom_config.disable=Disabled
hackaBLE.menu.custom_config.enable=Enabled
hackaBLE.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
hackaBLE.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

hackaBLE.menu.main_stack.1536=1536
hackaBLE.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
hackaBLE.menu.main_stack.2048=2048
hackaBLE.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
hackaBLE.menu.main_stack.2560=2560
hackaBLE.menu.main_stack.2560.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2560
hackaBLE.menu.main_stack.3072=3072
hackaBLE.menu.main_stack.3072.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3072
hackaBLE.menu.main_stack.3584=3584
hackaBLE.menu.main_stack.3584.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3584
hackaBLE.menu.main_stack.4096=4096
hackaBLE.menu.main_stack.4096.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=4096
hackaBLE.menu.main_stack.custom=Custom (config file)
hackaBLE.menu.main_stack.custom.build.main_stack_flags=

hackaBLE.menu.hs_stack.2048=2048
hackaBLE.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
hackaBLE.menu.hs_stack.2560=2560
hackaBLE.menu.hs_stack.2560.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2560
hackaBLE.menu.hs_stack.3072=3072
hackaBLE.menu.hs_stack.3072.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3072
hackaBLE.menu.hs_stack.3584=3584
hackaBLE.menu.hs_stack.3584.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3584
hackaBLE.menu.hs_stack.4096=4096
hackaBLE.menu.hs_stack.4096.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
hackaBLE.menu.hs_stack.custom=Custom (config file)
hackaBLE.menu.hs_stack.custom.build.hs_stack_flags=

hackaBLE.menu.role.all=All
hackaBLE.menu.role.all.build.nimble_flags=
hackaBLE.menu.role.periph=Peripheral
hackaBLE.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
hackaBLE.menu.role.adv=Advertiser
hackaBLE.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
hackaBLE.menu.role.scan=Scanner
hackaBLE.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
hackaBLE.menu.role.central=Client
hackaBLE.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

hackaBLE.menu.cppDbgLvl.none=None
hackaBLE.menu.cppDbgLvl.none.build.cpp_debug=0
hackaBLE.menu.cppDbgLvl.error=Error
hackaBLE.menu.cppDbgLvl.error.build.cpp_debug=1
hackaBLE.menu.cppDbgLvl.warn=Warn
hackaBLE.menu.cppDbgLvl.warn.build.cpp_debug=2
hackaBLE.menu.cppDbgLvl.info=Info
hackaBLE.menu.cppDbgLvl.info.build.cpp_debug=3
hackaBLE.menu.cppDbgLvl.debug=Debug
hackaBLE.menu.cppDbgLvl.debug.build.cpp_debug=4



hackaBLE_v2.name=Electronut labs hackaBLE_v2

hackaBLE_v2.upload.tool=openocd
hackaBLE_v2.upload.target=nrf52
hackaBLE_v2.upload.maximum_size=524288

hackaBLE_v2.bootloader.tool=openocd

hackaBLE_v2.build.mcu=cortex-m4
hackaBLE_v2.build.f_cpu=64000000
hackaBLE_v2.build.board=ELECTRONUT_HACKABLE_V2
hackaBLE_v2.build.core=nRF5
hackaBLE_v2.build.variant=hackaBLE_v2
hackaBLE_v2.build.variant_system_lib=
hackaBLE_v2.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
hackaBLE_v2.build.ldscript=nrf52_xxaa.ld
hackaBLE_v2.build.lfclk_flags=-DUSE_LFXO
hackaBLE_v2.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

hackaBLE_v2.menu.custom_config.disable=Disabled
hackaBLE_v2.menu.custom_config.enable=Enabled
hackaBLE_v2.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
hackaBLE_v2.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

hackaBLE_v2.menu.main_stack.1536=1536
hackaBLE_v2.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
hackaBLE_v2.menu.main_stack.2048=2048
hackaBLE_v2.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
hackaBLE_v2.menu.main_stack.2560=2560
hackaBLE_v2.menu.main_stack.2560.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2560
hackaBLE_v2.menu.main_stack.3072=3072
hackaBLE_v2.menu.main_stack.3072.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3072
hackaBLE_v2.menu.main_stack.3584=3584
hackaBLE_v2.menu.main_stack.3584.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3584
hackaBLE_v2.menu.main_stack.4096=4096
hackaBLE_v2.menu.main_stack.4096.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=4096
hackaBLE_v2.menu.main_stack.custom=Custom (config file)
hackaBLE_v2.menu.main_stack.custom.build.main_stack_flags=

hackaBLE_v2.menu.hs_stack.2048=2048
hackaBLE_v2.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
hackaBLE_v2.menu.hs_stack.2560=2560
hackaBLE_v2.menu.hs_stack.2560.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2560
hackaBLE_v2.menu.hs_stack.3072=3072
hackaBLE_v2.menu.hs_stack.3072.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3072
hackaBLE_v2.menu.hs_stack.3584=3584
hackaBLE_v2.menu.hs_stack.3584.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3584
hackaBLE_v2.menu.hs_stack.4096=4096
hackaBLE_v2.menu.hs_stack.4096.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
hackaBLE_v2.menu.hs_stack.custom=Custom (config file)
hackaBLE_v2.menu.hs_stack.custom.build.hs_stack_flags=

hackaBLE_v2.menu.role.all=All
hackaBLE_v2.menu.role.all.build.nimble_flags=
hackaBLE_v2.menu.role.periph=Peripheral
hackaBLE_v2.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
hackaBLE_v2.menu.role.adv=Advertiser
hackaBLE_v2.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
hackaBLE_v2.menu.role.scan=Scanner
hackaBLE_v2.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
hackaBLE_v2.menu.role.central=Client
hackaBLE_v2.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

hackaBLE_v2.menu.cppDbgLvl.none=None
hackaBLE_v2.menu.cppDbgLvl.none.build.cpp_debug=0
hackaBLE_v2.menu.cppDbgLvl.error=Error
hackaBLE_v2.menu.cppDbgLvl.error.build.cpp_debug=1
hackaBLE_v2.menu.cppDbgLvl.warn=Warn
hackaBLE_v2.menu.cppDbgLvl.warn.build.cpp_debug=2
hackaBLE_v2.menu.cppDbgLvl.info=Info
hackaBLE_v2.menu.cppDbgLvl.info.build.cpp_debug=3
hackaBLE_v2.menu.cppDbgLvl.debug=Debug
hackaBLE_v2.menu.cppDbgLvl.debug.build.cpp_debug=4



Blend2.name=RedBear BLE Nano 2

Blend2.upload.tool=openocd
Blend2.upload.target=nrf52
Blend2.upload.maximum_size=913408

Blend2.bootloader.tool=openocd

Blend2.build.mcu=cortex-m4
Blend2.build.f_cpu=64000000
Blend2.build.board=RB_BLEND_2
Blend2.build.core=nRF5
Blend2.build.variant=RedBear_Blend2
Blend2.build.variant_system_lib=
Blend2.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Blend2.build.ldscript=nrf52_xxaa.ld
Blend2.build.lfclk_flags=-DUSE_LFXO
Blend2.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

