h2zero/n-able-Arduino/boards.txt
Blend2.menu.custom_config.disable=Disabled
Blend2.menu.custom_config.enable=Enabled
Blend2.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
Blend2.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

Blend2.menu.main_stack.1536=1536
Blend2.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
Blend2.menu.main_stack.2048=2048
Blend2.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
Blend2.menu.main_stack.2560=2560
Blend2.menu.main_stack.2560.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2560
Blend2.menu.main_stack.3072=3072
Blend2.menu.main_stack.3072.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3072
Blend2.menu.main_stack.3584=3584
Blend2.menu.main_stack.3584.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3584
Blend2.menu.main_stack.4096=4096
Blend2.menu.main_stack.4096.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=4096
Blend2.menu.main_stack.custom=Custom (config file)
Blend2.menu.main_stack.custom.build.main_stack_flags=

Blend2.menu.hs_stack.2048=2048
Blend2.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
Blend2.menu.hs_stack.2560=2560
Blend2.menu.hs_stack.2560.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2560
Blend2.menu.hs_stack.3072=3072
Blend2.menu.hs_stack.3072.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3072
Blend2.menu.hs_stack.3584=3584
Blend2.menu.hs_stack.3584.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3584
Blend2.menu.hs_stack.4096=4096
Blend2.menu.hs_stack.4096.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
Blend2.menu.hs_stack.custom=Custom (config file)
Blend2.menu.hs_stack.custom.build.hs_stack_flags=

Blend2.menu.role.all=All
Blend2.menu.role.all.build.nimble_flags=
Blend2.menu.role.periph=Peripheral
Blend2.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Blend2.menu.role.adv=Advertiser
Blend2.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Blend2.menu.role.scan=Scanner
Blend2.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Blend2.menu.role.central=Client
Blend2.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Blend2.menu.cppDbgLvl.none=None
Blend2.menu.cppDbgLvl.none.build.cpp_debug=0
Blend2.menu.cppDbgLvl.error=Error
Blend2.menu.cppDbgLvl.error.build.cpp_debug=1
Blend2.menu.cppDbgLvl.warn=Warn
Blend2.menu.cppDbgLvl.warn.build.cpp_debug=2
Blend2.menu.cppDbgLvl.info=Info
Blend2.menu.cppDbgLvl.info.build.cpp_debug=3
Blend2.menu.cppDbgLvl.debug=Debug
Blend2.menu.cppDbgLvl.debug.build.cpp_debug=4



BLENano2.name=RedBear BLE Nano 2

BLENano2.upload.tool=openocd
BLENano2.upload.target=nrf52
BLENano2.upload.maximum_size=913408

BLENano2.bootloader.tool=openocd

BLENano2.build.mcu=cortex-m4
BLENano2.build.f_cpu=64000000
BLENano2.build.board=RB_BLE_NANO_2
BLENano2.build.core=nRF5
BLENano2.build.variant=RedBear_BLENano2
BLENano2.build.variant_system_lib=
BLENano2.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
BLENano2.build.ldscript=nrf52_xxaa.ld
BLENano2.build.lfclk_flags=-DUSE_LFXO
BLENano2.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

BLENano2.menu.custom_config.disable=Disabled
BLENano2.menu.custom_config.enable=Enabled
BLENano2.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
BLENano2.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

BLENano2.menu.main_stack.1536=1536
BLENano2.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
BLENano2.menu.main_stack.2048=2048
BLENano2.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
BLENano2.menu.main_stack.2560=2560
BLENano2.menu.main_stack.2560.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2560
BLENano2.menu.main_stack.3072=3072
BLENano2.menu.main_stack.3072.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3072
BLENano2.menu.main_stack.3584=3584
BLENano2.menu.main_stack.3584.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3584
BLENano2.menu.main_stack.4096=4096
BLENano2.menu.main_stack.4096.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=4096
BLENano2.menu.main_stack.custom=Custom (config file)
BLENano2.menu.main_stack.custom.build.main_stack_flags=

BLENano2.menu.hs_stack.2048=2048
BLENano2.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
BLENano2.menu.hs_stack.2560=2560
BLENano2.menu.hs_stack.2560.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2560
BLENano2.menu.hs_stack.3072=3072
BLENano2.menu.hs_stack.3072.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3072
BLENano2.menu.hs_stack.3584=3584
BLENano2.menu.hs_stack.3584.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3584
BLENano2.menu.hs_stack.4096=4096
BLENano2.menu.hs_stack.4096.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
BLENano2.menu.hs_stack.custom=Custom (config file)
BLENano2.menu.hs_stack.custom.build.hs_stack_flags=

BLENano2.menu.role.all=All
BLENano2.menu.role.all.build.nimble_flags=
BLENano2.menu.role.periph=Peripheral
BLENano2.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BLENano2.menu.role.adv=Advertiser
BLENano2.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BLENano2.menu.role.scan=Scanner
BLENano2.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BLENano2.menu.role.central=Client
BLENano2.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BLENano2.menu.cppDbgLvl.none=None
BLENano2.menu.cppDbgLvl.none.build.cpp_debug=0
BLENano2.menu.cppDbgLvl.error=Error
BLENano2.menu.cppDbgLvl.error.build.cpp_debug=1
BLENano2.menu.cppDbgLvl.warn=Warn
BLENano2.menu.cppDbgLvl.warn.build.cpp_debug=2
BLENano2.menu.cppDbgLvl.info=Info
BLENano2.menu.cppDbgLvl.info.build.cpp_debug=3
BLENano2.menu.cppDbgLvl.debug=Debug
BLENano2.menu.cppDbgLvl.debug.build.cpp_debug=4



