h2zero/n-able-Arduino/boards.txt
BT5040.name=E104-BT5040

BT5040.upload.tool=nrfutil
BT5040.upload.target=nrf52
BT5040.upload.maximum_size=913408

BT5040.bootloader.tool=openocd

BT5040.build.mcu=cortex-m4
BT5040.build.f_cpu=64000000
BT5040.build.board=BT5040
BT5040.build.core=nRF5
BT5040.build.variant=nRF52840_Dongle
BT5040.build.variant_system_lib=
BT5040.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
BT5040.build.ldscript=nrf52840_dongle.ld
BT5040.build.vid=0x1915
BT5040.build.pid=0x521B
BT5040.build.lfclk_flags=-DUSE_LFXO
BT5040.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA -DUSE_TINYUSB -DUSB_CDC_DEFAULT_SERIAL -D__STACK_SIZE=2048 -DUSB_VID={build.vid} -DUSB_PID={build.pid} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

BT5040.menu.custom_config.disable=Disabled
BT5040.menu.custom_config.enable=Enabled
BT5040.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
BT5040.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

BT5040.menu.main_stack.1536=1536
BT5040.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
BT5040.menu.main_stack.2048=2048
BT5040.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
BT5040.menu.main_stack.2560=2560
BT5040.menu.main_stack.2560.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2560
BT5040.menu.main_stack.3072=3072
BT5040.menu.main_stack.3072.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3072
BT5040.menu.main_stack.3584=3584
BT5040.menu.main_stack.3584.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3584
BT5040.menu.main_stack.4096=4096
BT5040.menu.main_stack.4096.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=4096
BT5040.menu.main_stack.custom=Custom (config file)
BT5040.menu.main_stack.custom.build.main_stack_flags=

BT5040.menu.hs_stack.2048=2048
BT5040.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
BT5040.menu.hs_stack.2560=2560
BT5040.menu.hs_stack.2560.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2560
BT5040.menu.hs_stack.3072=3072
BT5040.menu.hs_stack.3072.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3072
BT5040.menu.hs_stack.3584=3584
BT5040.menu.hs_stack.3584.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3584
BT5040.menu.hs_stack.4096=4096
BT5040.menu.hs_stack.4096.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
BT5040.menu.hs_stack.custom=Custom (config file)
BT5040.menu.hs_stack.custom.build.hs_stack_flags=

BT5040.menu.role.all=All
BT5040.menu.role.all.build.nimble_flags=
BT5040.menu.role.periph=Peripheral
BT5040.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BT5040.menu.role.adv=Advertiser
BT5040.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BT5040.menu.role.scan=Scanner
BT5040.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BT5040.menu.role.central=Client
BT5040.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BT5040.menu.cppDbgLvl.none=None
BT5040.menu.cppDbgLvl.none.build.cpp_debug=0
BT5040.menu.cppDbgLvl.error=Error
BT5040.menu.cppDbgLvl.error.build.cpp_debug=1
BT5040.menu.cppDbgLvl.warn=Warn
BT5040.menu.cppDbgLvl.warn.build.cpp_debug=2
BT5040.menu.cppDbgLvl.info=Info
BT5040.menu.cppDbgLvl.info.build.cpp_debug=3
BT5040.menu.cppDbgLvl.debug=Debug
BT5040.menu.cppDbgLvl.debug.build.cpp_debug=4



# nRF52833 variants
###################

Generic_nRF52833.name=Generic nRF52833

Generic_nRF52833.upload.tool=openocd
Generic_nRF52833.upload.target=nrf52
Generic_nRF52833.upload.maximum_size=524288

Generic_nRF52833.bootloader.tool=openocd

Generic_nRF52833.build.mcu=cortex-m4
Generic_nRF52833.build.f_cpu=64000000
Generic_nRF52833.build.board=GENERIC_NRF52833
Generic_nRF52833.build.core=nRF5
Generic_nRF52833.build.variant=Generic
Generic_nRF52833.build.variant_system_lib=
Generic_nRF52833.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Generic_nRF52833.build.ldscript=nrf52833_xxaa.ld
Generic_nRF52833.build.extra_flags=-DNRF52_SERIES DNRF52833_XXAA -DUSE_TINYUSB -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

Generic_nRF52833.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF52833.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF52833.menu.lfclk.lfrc=RC Oscillator
Generic_nRF52833.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF52833.menu.lfclk.lfsynt=Synthesized
Generic_nRF52833.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

Generic_nRF52833.menu.custom_config.disable=Disabled
Generic_nRF52833.menu.custom_config.enable=Enabled
Generic_nRF52833.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
Generic_nRF52833.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

Generic_nRF52833.menu.main_stack.1536=1536
Generic_nRF52833.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
Generic_nRF52833.menu.main_stack.2048=2048
Generic_nRF52833.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
Generic_nRF52833.menu.main_stack.2560=2560
Generic_nRF52833.menu.main_stack.2560.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2560
Generic_nRF52833.menu.main_stack.3072=3072
Generic_nRF52833.menu.main_stack.3072.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3072
Generic_nRF52833.menu.main_stack.3584=3584
Generic_nRF52833.menu.main_stack.3584.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3584
Generic_nRF52833.menu.main_stack.4096=4096
Generic_nRF52833.menu.main_stack.4096.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=4096
Generic_nRF52833.menu.main_stack.custom=Custom (config file)
Generic_nRF52833.menu.main_stack.custom.build.main_stack_flags=

Generic_nRF52833.menu.hs_stack.2048=2048
Generic_nRF52833.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
Generic_nRF52833.menu.hs_stack.2560=2560
Generic_nRF52833.menu.hs_stack.2560.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2560
Generic_nRF52833.menu.hs_stack.3072=3072
Generic_nRF52833.menu.hs_stack.3072.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3072
Generic_nRF52833.menu.hs_stack.3584=3584
Generic_nRF52833.menu.hs_stack.3584.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3584
Generic_nRF52833.menu.hs_stack.4096=4096
Generic_nRF52833.menu.hs_stack.4096.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
Generic_nRF52833.menu.hs_stack.custom=Custom (config file)
Generic_nRF52833.menu.hs_stack.custom.build.hs_stack_flags=

Generic_nRF52833.menu.role.all=All
Generic_nRF52833.menu.role.all.build.nimble_flags=
Generic_nRF52833.menu.role.periph=Peripheral
Generic_nRF52833.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Generic_nRF52833.menu.role.adv=Advertiser
Generic_nRF52833.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Generic_nRF52833.menu.role.scan=Scanner
Generic_nRF52833.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Generic_nRF52833.menu.role.central=Client
Generic_nRF52833.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Generic_nRF52833.menu.cppDbgLvl.none=None
Generic_nRF52833.menu.cppDbgLvl.none.build.cpp_debug=0
Generic_nRF52833.menu.cppDbgLvl.error=Error
Generic_nRF52833.menu.cppDbgLvl.error.build.cpp_debug=1
Generic_nRF52833.menu.cppDbgLvl.warn=Warn
Generic_nRF52833.menu.cppDbgLvl.warn.build.cpp_debug=2
Generic_nRF52833.menu.cppDbgLvl.info=Info
Generic_nRF52833.menu.cppDbgLvl.info.build.cpp_debug=3
Generic_nRF52833.menu.cppDbgLvl.debug=Debug
Generic_nRF52833.menu.cppDbgLvl.debug.build.cpp_debug=4


