h2zero/n-able-Arduino/boards.txt
nRF52833DK.name=nRF52833 Dev Kit

nRF52833DK.upload.tool=openocd
nRF52833DK.upload.target=nrf52
nRF52833DK.upload.maximum_size=524288

nRF52833DK.bootloader.tool=openocd

nRF52833DK.build.mcu=cortex-m4
nRF52833DK.build.f_cpu=64000000
nRF52833DK.build.board=NRF52833_DK
nRF52833DK.build.core=nRF5
nRF52833DK.build.variant=nRF8233_DK
nRF52833DK.build.variant_system_lib=
nRF52833DK.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
nRF52833DK.build.ldscript=nrf52833_xxaa.ld
nRF52833DK.build.extra_flags=-DNRF52_SERIES DNRF52833_XXAA -DUSE_TINYUSB -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

nRF52833DK.menu.lfclk.lfxo=Crystal Oscillator
nRF52833DK.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
nRF52833DK.menu.lfclk.lfrc=RC Oscillator
nRF52833DK.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
nRF52833DK.menu.lfclk.lfsynt=Synthesized
nRF52833DK.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

nRF52833DK.menu.custom_config.disable=Disabled
nRF52833DK.menu.custom_config.enable=Enabled
nRF52833DK.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
nRF52833DK.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

nRF52833DK.menu.main_stack.1536=1536
nRF52833DK.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
nRF52833DK.menu.main_stack.2048=2048
nRF52833DK.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
nRF52833DK.menu.main_stack.2560=2560
nRF52833DK.menu.main_stack.2560.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2560
nRF52833DK.menu.main_stack.3072=3072
nRF52833DK.menu.main_stack.3072.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3072
nRF52833DK.menu.main_stack.3584=3584
nRF52833DK.menu.main_stack.3584.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3584
nRF52833DK.menu.main_stack.4096=4096
nRF52833DK.menu.main_stack.4096.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=4096
nRF52833DK.menu.main_stack.custom=Custom (config file)
nRF52833DK.menu.main_stack.custom.build.main_stack_flags=

nRF52833DK.menu.hs_stack.2048=2048
nRF52833DK.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
nRF52833DK.menu.hs_stack.2560=2560
nRF52833DK.menu.hs_stack.2560.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2560
nRF52833DK.menu.hs_stack.3072=3072
nRF52833DK.menu.hs_stack.3072.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3072
nRF52833DK.menu.hs_stack.3584=3584
nRF52833DK.menu.hs_stack.3584.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3584
nRF52833DK.menu.hs_stack.4096=4096
nRF52833DK.menu.hs_stack.4096.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
nRF52833DK.menu.hs_stack.custom=Custom (config file)
nRF52833DK.menu.hs_stack.custom.build.hs_stack_flags=

nRF52833DK.menu.role.all=All
nRF52833DK.menu.role.all.build.nimble_flags=
nRF52833DK.menu.role.periph=Peripheral
nRF52833DK.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
nRF52833DK.menu.role.adv=Advertiser
nRF52833DK.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
nRF52833DK.menu.role.scan=Scanner
nRF52833DK.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
nRF52833DK.menu.role.central=Client
nRF52833DK.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

nRF52833DK.menu.cppDbgLvl.none=None
nRF52833DK.menu.cppDbgLvl.none.build.cpp_debug=0
nRF52833DK.menu.cppDbgLvl.error=Error
nRF52833DK.menu.cppDbgLvl.error.build.cpp_debug=1
nRF52833DK.menu.cppDbgLvl.warn=Warn
nRF52833DK.menu.cppDbgLvl.warn.build.cpp_debug=2
nRF52833DK.menu.cppDbgLvl.info=Info
nRF52833DK.menu.cppDbgLvl.info.build.cpp_debug=3
nRF52833DK.menu.cppDbgLvl.debug=Debug
nRF52833DK.menu.cppDbgLvl.debug.build.cpp_debug=4


BBCmicrobitV2.name=BBC micro:bit V2

BBCmicrobitV2.vid.0=0x0d28
BBCmicrobitV2.pid.0=0x0204

BBCmicrobitV2.upload.tool=openocd
BBCmicrobitV2.upload.protocol=cmsis-dap
BBCmicrobitV2.upload.target=nrf52
BBCmicrobitV2.upload.maximum_size=524288
BBCmicrobitV2.upload.setup_command=transport select swd;

BBCmicrobitV2.bootloader.tool=openocd

BBCmicrobitV2.build.mcu=cortex-m4
BBCmicrobitV2.build.f_cpu=64000000
BBCmicrobitV2.build.board=BBC_MICROBIT_V2
BBCmicrobitV2.build.core=nRF5
BBCmicrobitV2.build.variant=BBCmicrobitV2
BBCmicrobitV2.build.variant_system_lib=
BBCmicrobitV2.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
BBCmicrobitV2.build.ldscript=nrf52833_xxaa.ld
BBCmicrobitV2.build.lfclk_flags=-DUSE_LFSYNT
BBCmicrobitV2.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA -DUSE_TINYUSB -D__STACK_SIZE=2048 -DUSB_VID={build.vid} -DUSB_PID={build.pid} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

BBCmicrobitV2.menu.custom_config.disable=Disabled
BBCmicrobitV2.menu.custom_config.enable=Enabled
BBCmicrobitV2.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
BBCmicrobitV2.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

BBCmicrobitV2.menu.main_stack.1536=1536
BBCmicrobitV2.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
BBCmicrobitV2.menu.main_stack.2048=2048
BBCmicrobitV2.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
BBCmicrobitV2.menu.main_stack.2560=2560
BBCmicrobitV2.menu.main_stack.2560.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2560
BBCmicrobitV2.menu.main_stack.3072=3072
BBCmicrobitV2.menu.main_stack.3072.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3072
BBCmicrobitV2.menu.main_stack.3584=3584
BBCmicrobitV2.menu.main_stack.3584.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3584
BBCmicrobitV2.menu.main_stack.4096=4096
BBCmicrobitV2.menu.main_stack.4096.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=4096
BBCmicrobitV2.menu.main_stack.custom=Custom (config file)
BBCmicrobitV2.menu.main_stack.custom.build.main_stack_flags=

BBCmicrobitV2.menu.hs_stack.2048=2048
BBCmicrobitV2.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
BBCmicrobitV2.menu.hs_stack.2560=2560
BBCmicrobitV2.menu.hs_stack.2560.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2560
BBCmicrobitV2.menu.hs_stack.3072=3072
BBCmicrobitV2.menu.hs_stack.3072.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3072
BBCmicrobitV2.menu.hs_stack.3584=3584
BBCmicrobitV2.menu.hs_stack.3584.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3584
BBCmicrobitV2.menu.hs_stack.4096=4096
BBCmicrobitV2.menu.hs_stack.4096.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
BBCmicrobitV2.menu.hs_stack.custom=Custom (config file)
BBCmicrobitV2.menu.hs_stack.custom.build.hs_stack_flags=

BBCmicrobitV2.menu.role.all=All
BBCmicrobitV2.menu.role.all.build.nimble_flags=
BBCmicrobitV2.menu.role.periph=Peripheral
BBCmicrobitV2.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BBCmicrobitV2.menu.role.adv=Advertiser
BBCmicrobitV2.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BBCmicrobitV2.menu.role.scan=Scanner
BBCmicrobitV2.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BBCmicrobitV2.menu.role.central=Client
BBCmicrobitV2.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BBCmicrobitV2.menu.cppDbgLvl.none=None
BBCmicrobitV2.menu.cppDbgLvl.none.build.cpp_debug=0
BBCmicrobitV2.menu.cppDbgLvl.error=Error
BBCmicrobitV2.menu.cppDbgLvl.error.build.cpp_debug=1
BBCmicrobitV2.menu.cppDbgLvl.warn=Warn
BBCmicrobitV2.menu.cppDbgLvl.warn.build.cpp_debug=2
BBCmicrobitV2.menu.cppDbgLvl.info=Info
BBCmicrobitV2.menu.cppDbgLvl.info.build.cpp_debug=3
BBCmicrobitV2.menu.cppDbgLvl.debug=Debug
BBCmicrobitV2.menu.cppDbgLvl.debug.build.cpp_debug=4
